УчетВУправляющихДляГит1/src/InformationRegisters/СоответствиеСкладовТорговымТочкам/СоответствиеСкладовТорговымТочкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоответствиеСкладовТорговымТочкам</name>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТорговаяТочка</name>
    <type>
      <types>CatalogRef.ТорговыеТочки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/Catalogs/ТорговыеТочки/ТорговыеТочки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТорговыеТочки</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УчетВУправляющихДляГит1/src/Catalogs/Склады/Склады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Склады</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Комментарий</name>
    <comment> Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦенРозничнойТорговли</name>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСклада</name>
    <comment> Тип склада: оптовый, розничный, неавтоматизированная торговая точка</comment>
    <type>
      <types>EnumRef.ТипыСкладов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УчетВУправляющихДляГит1/src/InformationRegisters/СоответствиеСкладовТорговымТочкам/Forms/ВыборЗначенийИзСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("ПоказыватьОрганизации", ПоказыватьОрганизации);
	ВходящиеПараметры = Новый Структура("ЗаголовокФормыВыбора, ИмяТаблицыВыбора, МассивВыбранныхЗначений");
	ЗаполнитьЗначенияСвойств(ВходящиеПараметры, Параметры);
	
	Заголовок = ВходящиеПараметры.ЗаголовокФормыВыбора;
	
	ЗаполнитьСписокЗначенийДляВыбора(ВходящиеПараметры.ИмяТаблицыВыбора, ВходящиеПараметры.МассивВыбранныхЗначений);
	
	УправлениеФормой();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если НЕ ТолькоПросмотр И Поле.Имя <> Элементы.СписокПометка.Имя Тогда
		
		ВыбранноеЗначение = Список.НайтиПоИдентификатору(ВыбраннаяСтрока).Значение;
		ОповеститьОВыборе(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыбранноеЗначение));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьОтмеченные(Команда)
	
	ОтмеченныеЭлементы = ОбщегоНазначенияКлиентСервер.ОтмеченныеЭлементы(Список);
	ОповеститьОВыборе(ОтмеченныеЭлементы);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для Каждого СтрокаСписка Из Список Цикл
		ПоменятьПометку(СтрокаСписка, Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для Каждого СтрокаСписка Из Список Цикл
		ПоменятьПометку(СтрокаСписка, Ложь);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеФормой()
	
	ВидимостьКолонкиОрганизация = ПоказыватьОрганизации
		И ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизацийБухгалтерскийУчет");
	
	Элементы.СписокОрганизация.Видимость = ВидимостьКолонкиОрганизация;
	
	Элементы.Список.Шапка = ВидимостьКолонкиОрганизация;
	
	Элементы.СписокВыбратьОтмеченные.Видимость = НЕ ТолькоПросмотр;
	Элементы.СписокУстановитьФлажки.Видимость  = НЕ ТолькоПросмотр;
	Элементы.СписокСнятьФлажки.Видимость       = НЕ ТолькоПросмотр;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоменятьПометку(СтрокаСписка, ЗначениеПометки)
	
	СтрокаСписка.Пометка = ЗначениеПометки;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокЗначенийДляВыбора(ИмяТаблицыВыбора, ВыбранныеЗначения)
	
	ТаблицаЗначений = Неопределено;
	Если ИмяТаблицыВыбора = "Справочник.ТорговыеТочки" Тогда
		ТаблицаЗначений = ТаблицаВыбораТорговыхТочек(ВыбранныеЗначения);
	ИначеЕсли ИмяТаблицыВыбора = "Справочник.Склады" Тогда
		ТаблицаЗначений = ТаблицаВыбораСкладов(ВыбранныеЗначения);
	КонецЕсли;
	
	Если ТаблицаЗначений = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Список.Загрузить(ТаблицаЗначений);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТаблицаВыбораТорговыхТочек(ВыбранныеЗначения)
	
	// При выборе торговых точек пользователь должен видеть только те торговые точки,
	// которые принадлежат доступным ему организациям.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ТорговыеТочки.Ссылка В (&ВыбранныеЗначения)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Пометка,
	|	ТорговыеТочки.Представление,
	|	ТорговыеТочки.Ссылка КАК Значение,
	|	Организации.Ссылка КАК Организация
	|ИЗ
	|	Справочник.ТорговыеТочки КАК ТорговыеТочки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО Организации.Ссылка = ТорговыеТочки.Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организации.Наименование,
	|	ТорговыеТочки.Наименование";
	
	Запрос.УстановитьПараметр("ВыбранныеЗначения", ВыбранныеЗначения);
	
	ТаблицаТорговыеТочки = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаТорговыеТочки;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТаблицаВыбораСкладов(ВыбранныеЗначения)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Склады.Ссылка В (&ВыбранныеЗначения)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Пометка,
	|	Склады.Представление,
	|	Склады.Ссылка КАК Значение
	|ИЗ
	|	Справочник.Склады КАК Склады
	|
	|УПОРЯДОЧИТЬ ПО
	|	Склады.Наименование";
	
	Запрос.УстановитьПараметр("ВыбранныеЗначения", ВыбранныеЗначения);
	
	ТаблицаСклады = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаСклады;
	
КонецФункции

#КонецОбласти
